In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')

In [8]:
# 그룹화
# 해당되는 그룹의 리스트 보여준다.
df.groupby('학교').get_group('구로고')
df.groupby('학교').size() # 해당 학교 학생수를 확인
df.groupby('학교').size()['구로고'] # 해당 학교 학생수를 확인
df.groupby('학교')['키'].mean() # 해당 학교 학생수를 확인
df.groupby('학교').describe()

         키                                                              국어  \
     count        mean        std    min    25%    50%    75%    max count
학교
구로고    5.0  184.800000  10.568822  168.0  184.0  187.0  188.0  197.0   5.0
디지털고   3.0  193.333333   7.571878  188.0  189.0  190.0  196.0  202.0   3.0

                 ...    과학          사회                                     \
           mean  ...   75%   max count  mean        std   min   25%   50%
학교               ...
구로고   53.000000  ...  80.0  95.0   5.0  55.0  34.820971  10.0  25.0  75.0
디지털고  78.333333  ...  90.0  95.0   3.0  70.0  31.224990  35.0  57.5  80.0


       75%   max
학교
구로고   80.0  85.0
디지털고  87.5  95.0

[2 rows x 48 columns]

In [9]:
df.groupby('학교').get_group('디지털고')

       이름    학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    박동현  디지털고  202   80  100  95  85  80       C
7번    박혜정  디지털고  188   55   65  45  40  35  PYTHON
8번    승근열  디지털고  190  100   85  90  95  95      C#

In [11]:
df.describe()
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

그룹별로 최대값, 최소값, 평균, 합계

In [ ]:
df.groupby('학교')['키'].mean()
df.groupby('학교')[['키', '국어']].mean()

               키         국어
학교
구로고   184.800000  53.000000
디지털고  193.333333  78.333333

In [13]:
# 컬럼별
df['키'].mean()

np.float64(188.0)

In [15]:
df.groupby('학교')
df.groupby('학교')['키'].mean()

학교
구로고     184.800000
디지털고    193.333333
Name: 키, dtype: float64

In [16]:
# 컬럼을 추가
df['학년'] = [3, 3, 2, 1, 3, 2, 2, 1]

In [18]:
df.groupby(['학교', '학년'])

In [19]:
df.groupby('학교')[['SW특기', '이름']].count()

      SW특기  이름
학교
구로고      3   5
디지털고     3   3

In [21]:
df.groupby('학년').sum().sort_values('키')

           이름           학교    키   국어   영어   수학   과학   사회               SW특기
학년
1      김수찬승근열      구로고디지털고  377  140  145  160  170  175                 C#
2   강호림박동현박혜정  구로고디지털고디지털고  558  215  240  210  205  190  JavascriptCPYTHON
3   강나래강태원김재욱    구로고구로고구로고  569  145  140  160  185  120         PythonJava

In [24]:
# 그룹화
# 컬럼을 기준으로 그룹핑 - sum(), 합계, count() 개수, size() 크기
# mean(), max(), min() 안됨 column값 지정해주면된다
df.groupby('학교')['키'].max()

# 그룹별 키로 정렬
df.groupby('학년')['키'].mean().sort_values(ascending=False)

학년
3    189.666667
1    188.500000
2    186.000000
Name: 키, dtype: float64

In [27]:
# 학교로 그룹핑을 해서 구로고 학생만 학년으로 학생수 출력
df.groupby('학교')['학년'].value_counts().loc['구로고']
# 퍼센트로 출력됨 : normalize=True
df.groupby('학교')['학년'].value_counts(normalize=True).loc['구로고']

학년
3    0.6
1    0.2
2    0.2
Name: proportion, dtype: float64